; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p12---int100n150-m25---int100c110---s516---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level18 level18)
(sum level0 level22 level22)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level18 level19)
(sum level1 level22 level23)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level18 level20)
(sum level2 level22 level24)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level18 level21)
(sum level3 level22 level25)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level18 level22)
(sum level4 level22 level26)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level18 level23)
(sum level5 level22 level27)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level18 level24)
(sum level6 level22 level28)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level18 level25)
(sum level7 level22 level29)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level18 level26)
(sum level8 level22 level30)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level18 level27)
(sum level9 level22 level31)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level18 level28)
(sum level10 level22 level32)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level18 level29)
(sum level11 level22 level33)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level18 level30)
(sum level12 level22 level34)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level18 level31)
(sum level13 level22 level35)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level18 level32)
(sum level14 level22 level36)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level18 level33)
(sum level15 level22 level37)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level18 level34)
(sum level16 level22 level38)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level18 level35)
(sum level17 level22 level39)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level18 level36)
(sum level18 level22 level40)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level18 level37)
(sum level19 level22 level41)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level18 level38)
(sum level20 level22 level42)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level18 level39)
(sum level21 level22 level43)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level18 level40)
(sum level22 level22 level44)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level18 level41)
(sum level23 level22 level45)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level18 level42)
(sum level24 level22 level46)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level25 level18 level43)
(sum level25 level22 level47)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level26 level18 level44)
(sum level26 level22 level48)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level14 level41)
(sum level27 level16 level43)
(sum level27 level18 level45)
(sum level27 level22 level49)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level14 level42)
(sum level28 level16 level44)
(sum level28 level18 level46)
(sum level28 level22 level50)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level14 level43)
(sum level29 level16 level45)
(sum level29 level18 level47)
(sum level29 level22 level51)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level14 level44)
(sum level30 level16 level46)
(sum level30 level18 level48)
(sum level30 level22 level52)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level14 level45)
(sum level31 level16 level47)
(sum level31 level18 level49)
(sum level31 level22 level53)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level14 level46)
(sum level32 level16 level48)
(sum level32 level18 level50)
(sum level32 level22 level54)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level14 level47)
(sum level33 level16 level49)
(sum level33 level18 level51)
(sum level33 level22 level55)
(sum level34 level2 level36)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level14 level48)
(sum level34 level16 level50)
(sum level34 level18 level52)
(sum level34 level22 level56)
(sum level35 level2 level37)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level14 level49)
(sum level35 level16 level51)
(sum level35 level18 level53)
(sum level35 level22 level57)
(sum level36 level2 level38)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level14 level50)
(sum level36 level16 level52)
(sum level36 level18 level54)
(sum level36 level22 level58)
(sum level37 level2 level39)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level14 level51)
(sum level37 level16 level53)
(sum level37 level18 level55)
(sum level37 level22 level59)
(sum level38 level2 level40)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level14 level52)
(sum level38 level16 level54)
(sum level38 level18 level56)
(sum level38 level22 level60)
(sum level39 level2 level41)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level14 level53)
(sum level39 level16 level55)
(sum level39 level18 level57)
(sum level39 level22 level61)
(sum level40 level2 level42)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level14 level54)
(sum level40 level16 level56)
(sum level40 level18 level58)
(sum level40 level22 level62)
(sum level41 level2 level43)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level14 level55)
(sum level41 level16 level57)
(sum level41 level18 level59)
(sum level41 level22 level63)
(sum level42 level2 level44)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level14 level56)
(sum level42 level16 level58)
(sum level42 level18 level60)
(sum level42 level22 level64)
(sum level43 level2 level45)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level14 level57)
(sum level43 level16 level59)
(sum level43 level18 level61)
(sum level43 level22 level65)
(sum level44 level2 level46)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level14 level58)
(sum level44 level16 level60)
(sum level44 level18 level62)
(sum level44 level22 level66)
(sum level45 level2 level47)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level14 level59)
(sum level45 level16 level61)
(sum level45 level18 level63)
(sum level45 level22 level67)
(sum level46 level2 level48)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level14 level60)
(sum level46 level16 level62)
(sum level46 level18 level64)
(sum level46 level22 level68)
(sum level47 level2 level49)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level14 level61)
(sum level47 level16 level63)
(sum level47 level18 level65)
(sum level47 level22 level69)
(sum level48 level2 level50)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level14 level62)
(sum level48 level16 level64)
(sum level48 level18 level66)
(sum level48 level22 level70)
(sum level49 level2 level51)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level14 level63)
(sum level49 level16 level65)
(sum level49 level18 level67)
(sum level49 level22 level71)
(sum level50 level2 level52)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level14 level64)
(sum level50 level16 level66)
(sum level50 level18 level68)
(sum level50 level22 level72)
(sum level51 level2 level53)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level14 level65)
(sum level51 level16 level67)
(sum level51 level18 level69)
(sum level51 level22 level73)
(sum level52 level2 level54)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level14 level66)
(sum level52 level16 level68)
(sum level52 level18 level70)
(sum level52 level22 level74)
(sum level53 level2 level55)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level14 level67)
(sum level53 level16 level69)
(sum level53 level18 level71)
(sum level53 level22 level75)
(sum level54 level2 level56)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level14 level68)
(sum level54 level16 level70)
(sum level54 level18 level72)
(sum level54 level22 level76)
(sum level55 level2 level57)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level14 level69)
(sum level55 level16 level71)
(sum level55 level18 level73)
(sum level55 level22 level77)
(sum level56 level2 level58)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level14 level70)
(sum level56 level16 level72)
(sum level56 level18 level74)
(sum level56 level22 level78)
(sum level57 level2 level59)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level14 level71)
(sum level57 level16 level73)
(sum level57 level18 level75)
(sum level57 level22 level79)
(sum level58 level2 level60)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level14 level72)
(sum level58 level16 level74)
(sum level58 level18 level76)
(sum level58 level22 level80)
(sum level59 level2 level61)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level14 level73)
(sum level59 level16 level75)
(sum level59 level18 level77)
(sum level59 level22 level81)
(sum level60 level2 level62)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level14 level74)
(sum level60 level16 level76)
(sum level60 level18 level78)
(sum level60 level22 level82)
(sum level61 level2 level63)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level14 level75)
(sum level61 level16 level77)
(sum level61 level18 level79)
(sum level61 level22 level83)
(sum level62 level2 level64)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level14 level76)
(sum level62 level16 level78)
(sum level62 level18 level80)
(sum level62 level22 level84)
(sum level63 level2 level65)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level14 level77)
(sum level63 level16 level79)
(sum level63 level18 level81)
(sum level64 level2 level66)
(sum level64 level4 level68)
(sum level64 level5 level69)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level14 level78)
(sum level64 level16 level80)
(sum level64 level18 level82)
(sum level65 level2 level67)
(sum level65 level4 level69)
(sum level65 level5 level70)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level65 level14 level79)
(sum level65 level16 level81)
(sum level65 level18 level83)
(sum level66 level2 level68)
(sum level66 level4 level70)
(sum level66 level5 level71)
(sum level66 level6 level72)
(sum level66 level7 level73)
(sum level66 level14 level80)
(sum level66 level16 level82)
(sum level66 level18 level84)
(sum level67 level2 level69)
(sum level67 level4 level71)
(sum level67 level5 level72)
(sum level67 level6 level73)
(sum level67 level7 level74)
(sum level67 level14 level81)
(sum level67 level16 level83)
(sum level68 level2 level70)
(sum level68 level4 level72)
(sum level68 level5 level73)
(sum level68 level6 level74)
(sum level68 level7 level75)
(sum level68 level14 level82)
(sum level68 level16 level84)
(sum level69 level2 level71)
(sum level69 level4 level73)
(sum level69 level5 level74)
(sum level69 level6 level75)
(sum level69 level7 level76)
(sum level69 level14 level83)
(sum level70 level2 level72)
(sum level70 level4 level74)
(sum level70 level5 level75)
(sum level70 level6 level76)
(sum level70 level7 level77)
(sum level70 level14 level84)
(sum level71 level2 level73)
(sum level71 level4 level75)
(sum level71 level5 level76)
(sum level71 level6 level77)
(sum level71 level7 level78)
(sum level72 level2 level74)
(sum level72 level4 level76)
(sum level72 level5 level77)
(sum level72 level6 level78)
(sum level72 level7 level79)
(sum level73 level2 level75)
(sum level73 level4 level77)
(sum level73 level5 level78)
(sum level73 level6 level79)
(sum level73 level7 level80)
(sum level74 level2 level76)
(sum level74 level4 level78)
(sum level74 level5 level79)
(sum level74 level6 level80)
(sum level74 level7 level81)
(sum level75 level2 level77)
(sum level75 level4 level79)
(sum level75 level5 level80)
(sum level75 level6 level81)
(sum level75 level7 level82)
(sum level76 level2 level78)
(sum level76 level4 level80)
(sum level76 level5 level81)
(sum level76 level6 level82)
(sum level76 level7 level83)
(sum level77 level2 level79)
(sum level77 level4 level81)
(sum level77 level5 level82)
(sum level77 level6 level83)
(sum level77 level7 level84)
(sum level78 level2 level80)
(sum level78 level4 level82)
(sum level78 level5 level83)
(sum level78 level6 level84)
(sum level79 level2 level81)
(sum level79 level4 level83)
(sum level79 level5 level84)
(sum level80 level2 level82)
(sum level80 level4 level84)
(sum level81 level2 level83)
(sum level82 level2 level84)

(connected l0 l2)
(fuelcost level16 l0 l2)
(connected l0 l4)
(fuelcost level7 l0 l4)
(connected l0 l6)
(fuelcost level14 l0 l6)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l5)
(fuelcost level18 l1 l5)
(connected l2 l0)
(fuelcost level16 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l2 l6)
(fuelcost level4 l2 l6)
(connected l3 l4)
(fuelcost level22 l3 l4)
(connected l3 l5)
(fuelcost level2 l3 l5)
(connected l3 l6)
(fuelcost level5 l3 l6)
(connected l4 l0)
(fuelcost level7 l4 l0)
(connected l4 l3)
(fuelcost level22 l4 l3)
(connected l4 l6)
(fuelcost level16 l4 l6)
(connected l5 l1)
(fuelcost level18 l5 l1)
(connected l5 l3)
(fuelcost level2 l5 l3)
(connected l6 l0)
(fuelcost level14 l6 l0)
(connected l6 l2)
(fuelcost level4 l6 l2)
(connected l6 l3)
(fuelcost level5 l6 l3)
(connected l6 l4)
(fuelcost level16 l6 l4)

(at t0 l2)
(fuel t0 level84)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l0)
(at p3 l0)
(at p4 l6)
(at p5 l4)
(at p6 l4)
(at p7 l5)
(at p8 l2)
(at p9 l5)
(at p10 l1)
(at p11 l5)
)

(:goal
(and
(at p0 l2)
(at p1 l4)
(at p2 l1)
(at p3 l3)
(at p4 l3)
(at p5 l1)
(at p6 l0)
(at p7 l1)
(at p8 l6)
(at p9 l6)
(at p10 l3)
(at p11 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 0 of 12
2. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 12
3. (drive t0 l2 l6 level80 level4 level84)
   deleted: (at t0 l2) (fuel t0 level84)
   added: (at t0 l6) (fuel t0 level80)
   goals met: 0 of 12
4. (unload p8 t0 l6)
   deleted: (in p8 t0)
   added: (at p8 l6)
   goals met: 1 of 12
5. (load p4 t0 l6)
   deleted: (at p4 l6)
   added: (in p4 t0)
   goals met: 1 of 12
6. (drive t0 l6 l4 level64 level16 level80)
   deleted: (at t0 l6) (fuel t0 level80)
   added: (at t0 l4) (fuel t0 level64)
   goals met: 1 of 12
7. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 2 of 12
8. (load p6 t0 l4)
   deleted: (at p6 l4)
   added: (in p6 t0)
   goals met: 2 of 12
9. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 2 of 12
10. (drive t0 l4 l0 level57 level7 level64)
   deleted: (at t0 l4) (fuel t0 level64)
   added: (at t0 l0) (fuel t0 level57)
   goals met: 2 of 12
11. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 3 of 12
12. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 3 of 12
13. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 3 of 12
14. (drive t0 l0 l2 level41 level16 level57)
   deleted: (at t0 l0) (fuel t0 level57)
   added: (at t0 l2) (fuel t0 level41)
   goals met: 3 of 12
15. (drive t0 l2 l1 level35 level6 level41)
   deleted: (at t0 l2) (fuel t0 level41)
   added: (at t0 l1) (fuel t0 level35)
   goals met: 3 of 12
16. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 3 of 12
17. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 3 of 12
18. (drive t0 l1 l5 level17 level18 level35)
   deleted: (at t0 l1) (fuel t0 level35)
   added: (at t0 l5) (fuel t0 level17)
   goals met: 3 of 12
19. (load p11 t0 l5)
   deleted: (at p11 l5)
   added: (in p11 t0)
   goals met: 3 of 12
20. (load p7 t0 l5)
   deleted: (at p7 l5)
   added: (in p7 t0)
   goals met: 3 of 12
21. (load p9 t0 l5)
   deleted: (at p9 l5)
   added: (in p9 t0)
   goals met: 3 of 12
22. (drive t0 l5 l3 level15 level2 level17)
   deleted: (at t0 l5) (fuel t0 level17)
   added: (at t0 l3) (fuel t0 level15)
   goals met: 3 of 12
23. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 4 of 12
24. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 5 of 12
25. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 6 of 12
26. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 7 of 12
27. (drive t0 l3 l6 level10 level5 level15)
   deleted: (at t0 l3) (fuel t0 level15)
   added: (at t0 l6) (fuel t0 level10)
   goals met: 7 of 12
28. (unload p9 t0 l6)
   deleted: (in p9 t0)
   added: (at p9 l6)
   goals met: 8 of 12
29. (drive t0 l6 l2 level6 level4 level10)
   deleted: (at t0 l6) (fuel t0 level10)
   added: (at t0 l2) (fuel t0 level6)
   goals met: 8 of 12
30. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 9 of 12
31. (drive t0 l2 l1 level0 level6 level6)
   deleted: (at t0 l2) (fuel t0 level6)
   added: (at t0 l1) (fuel t0 level0)
   goals met: 9 of 12
32. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 10 of 12
33. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 11 of 12
34. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 12 of 12
